In [1]:
import pandas as ka
import numpy as ii

print(ka.__version__)
print(ii.__version__)

1.1.3
1.19.2

In [3]:
n_rows = 5
n_cols = 2
cols = ['omset', 'operasional']

df = ka.DataFrame(ii.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns=cols)
df

   omset  operasional
0      5            7
1      5           13
2     14            1
3      3            5
4      9            5

In [4]:
df['omset'] = df['omset'] * 100_000
df['operasional'] = df['operasional'] * 10_000
df

     omset  operasional
0   500000        70000
1   500000       130000
2  1400000        10000
3   300000        50000
4   900000        50000

In [6]:
df.index = ka.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

/opt/anaconda3/lib/python3.8/site-packages/pandas/util/__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

     tanggal    omset  operasional
0 2000-01-01   500000        70000
1 2000-01-02   500000       130000
2 2000-01-03  1400000        10000
3 2000-01-04   300000        50000
4 2000-01-05   900000        50000

In [7]:
formatku = {'tanggal':'{:%d/%m/%y}',
           'operasional':'Rp {:.2f}',
           'omset':'Rp {:.2f}'}

laporan = df.style.format(formatku)
laporan

In [8]:
type(laporan)

pandas.io.formats.style.Styler

In [9]:
laporan.hide_index()

In [10]:
laporan.set_caption('Data Omset dan Operasional')

In [12]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='grey')